# Applications
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
cask_args appdir: '/Applications'

# ----------------------------------
# These are the important packages
# ----------------------------------
brew "diff-so-fancy"
brew "trash" if OS.mac?

brew "python@3.7"
brew "python@3.8"
brew "python@3.9"
brew "python@3.10"
brew "python@3.11"

cask "android-file-transfer"
cask "docker"
cask "dropbox"
cask "google-chrome"
cask "iterm2"
cask "pycharm"
cask "spectacle"
cask "teamviewer"
cask "visual-studio-code"
cask "vlc"

# ----------------------------------
# Nice to have packages (optional)
# ----------------------------------

# brew "streamlink"
brew "mpg123"
brew "translate-shell"

cask "barrier"
cask "betterzip"
cask "fanny"
cask "ferdium"
cask "finicky"
cask "github"
cask "mendeley"
cask "presentation"
cask "signal"
cask "Skim"
cask "skype"
cask "spotify"
cask "spotifree"
cask "texstudio"
cask "transmission"
cask "tor-browser"
cask "zoom"
cask "zotero"

# Quicklook stuff
cask "qlcolorcode"
cask "qlstephen"
cask "qlmarkdown"
cask "quicklook-json"
cask "quicklook-csv"
cask "qlimagesize"
cask "qlvideo"
cask "suspicious-package"

# Big Stuff
cask "mactex"

# ----------------------------------
# App Store Installations
# ----------------------------------

# Apple Stuff
mas "Keynote" , id: 409183694
mas "Pages" , id: 409201541
mas "Numbers" , id: 409203825
mas "iMovie" , id: 408981434

# Microsoft Stuff
mas "OneDrive" , id: 823766827
mas "Microsoft Remote Desktop" , id: 1295203466
mas "Microsoft Word" , id: 462054704
mas "Microsoft Excel" , id: 462058435
mas "Microsoft PowerPoint" , id: 462062816

# Other Stuff
mas "The Unarchiver" , id: 425424353
mas "Gapplin" , id: 768053424
mas "Slack for Desktop" , id: 803453959

# Big Stuff
mas "Xcode" , id: 497799835
