# Applications
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
cask_args appdir: '/Applications'

brew "mas"  # Mac App Store CLI

# ----------------------------------
# These are the important packages
# ----------------------------------
brew "bat"
brew "bash-completion"
brew "cask"
brew "diff-so-fancy"
brew "graphviz"
brew "rsync"
brew "tldr"
brew "tmux"
brew "trash"
brew "tree"
brew "wget"
brew "vim"
brew "z"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

cask "atom"
cask "android-file-transfer"
cask "docker"
cask "dropbox"
cask "google-chrome"
cask "iterm2"
cask "spectacle"
cask "teamviewer"
cask "vlc"

# ----------------------------------
# Nice to have packages (optional)
# ----------------------------------

brew "streamlink"
brew "mpg123"
brew "translate-shell"

cask "betterzip"
cask "github"
cask "mactex"
cask "mendeley-desktop"
cask "presentation"
cask "Skim"
cask "skype"
cask "spotify"
cask "spotifree"
cask "station"
cask "texstudio"
cask "transmission"
cask "zotero"

# Quicklook stuff
cask "qlcolorcode"
cask "qlstephen"
cask "qlmarkdown"
cask "quicklook-json"
cask "quicklook-csv"
cask "qlimagesize"
cask "qlvideo"


# ----------------------------------
# App Store Installations
# ----------------------------------

# Apple Stuff
mas "Keynote" , id: 409183694
mas "Pages" , id: 409201541
mas "Numbers" , id: 409203825
mas "iMovie" , id: 408981434
mas "Xcode" , id: 497799835

# Microsoft Stuff
mas "OneDrive", id: 823766827
mas "Microsoft Remote Desktop" , id: 1295203466

# Other Stuff
mas "1Password", id: 443987910
mas "The Unarchiver" , id: 425424353
mas "Gapplin" , id: 768053424
